bharathkeshavamurthy/Stormbreaker/src/measurement-campaign/Talos/src/main/cpp/org/purdue/ece/talos/esp-idf/components/soc/esp32s2beta/include/soc/host_reg.h
#define HOST_SLCHOST_PKT_LEN_REG          (DR_REG_SLCHOST_BASE + 0x60)
/* HOST_HOSTSLC0_LEN_CHECK : RO ;bitpos:[31:20] ;default: 10'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN_CHECK  0x00000FFF
#define HOST_HOSTSLC0_LEN_CHECK_M  ((HOST_HOSTSLC0_LEN_CHECK_V)<<(HOST_HOSTSLC0_LEN_CHECK_S))
#define HOST_HOSTSLC0_LEN_CHECK_V  0xFFF
#define HOST_HOSTSLC0_LEN_CHECK_S  20
/* HOST_HOSTSLC0_LEN : RO ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define HOST_HOSTSLC0_LEN  0x000FFFFF
#define HOST_HOSTSLC0_LEN_M  ((HOST_HOSTSLC0_LEN_V)<<(HOST_HOSTSLC0_LEN_S))
#define HOST_HOSTSLC0_LEN_V  0xFFFFF
#define HOST_HOSTSLC0_LEN_S  0

#define HOST_SLCHOST_STATE_W0_REG          (DR_REG_SLCHOST_BASE + 0x64)
/* HOST_SLCHOST_STATE3 : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE3  0x000000FF
#define HOST_SLCHOST_STATE3_M  ((HOST_SLCHOST_STATE3_V)<<(HOST_SLCHOST_STATE3_S))
#define HOST_SLCHOST_STATE3_V  0xFF
#define HOST_SLCHOST_STATE3_S  24
/* HOST_SLCHOST_STATE2 : RO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE2  0x000000FF
#define HOST_SLCHOST_STATE2_M  ((HOST_SLCHOST_STATE2_V)<<(HOST_SLCHOST_STATE2_S))
#define HOST_SLCHOST_STATE2_V  0xFF
#define HOST_SLCHOST_STATE2_S  16
/* HOST_SLCHOST_STATE1 : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE1  0x000000FF
#define HOST_SLCHOST_STATE1_M  ((HOST_SLCHOST_STATE1_V)<<(HOST_SLCHOST_STATE1_S))
#define HOST_SLCHOST_STATE1_V  0xFF
#define HOST_SLCHOST_STATE1_S  8
/* HOST_SLCHOST_STATE0 : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE0  0x000000FF
#define HOST_SLCHOST_STATE0_M  ((HOST_SLCHOST_STATE0_V)<<(HOST_SLCHOST_STATE0_S))
#define HOST_SLCHOST_STATE0_V  0xFF
#define HOST_SLCHOST_STATE0_S  0

#define HOST_SLCHOST_STATE_W1_REG          (DR_REG_SLCHOST_BASE + 0x68)
/* HOST_SLCHOST_STATE7 : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE7  0x000000FF
#define HOST_SLCHOST_STATE7_M  ((HOST_SLCHOST_STATE7_V)<<(HOST_SLCHOST_STATE7_S))
#define HOST_SLCHOST_STATE7_V  0xFF
#define HOST_SLCHOST_STATE7_S  24
/* HOST_SLCHOST_STATE6 : RO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE6  0x000000FF
#define HOST_SLCHOST_STATE6_M  ((HOST_SLCHOST_STATE6_V)<<(HOST_SLCHOST_STATE6_S))
#define HOST_SLCHOST_STATE6_V  0xFF
#define HOST_SLCHOST_STATE6_S  16
/* HOST_SLCHOST_STATE5 : RO ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE5  0x000000FF
#define HOST_SLCHOST_STATE5_M  ((HOST_SLCHOST_STATE5_V)<<(HOST_SLCHOST_STATE5_S))
#define HOST_SLCHOST_STATE5_V  0xFF
#define HOST_SLCHOST_STATE5_S  8
/* HOST_SLCHOST_STATE4 : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_STATE4  0x000000FF
#define HOST_SLCHOST_STATE4_M  ((HOST_SLCHOST_STATE4_V)<<(HOST_SLCHOST_STATE4_S))
#define HOST_SLCHOST_STATE4_V  0xFF
#define HOST_SLCHOST_STATE4_S  0

#define HOST_SLCHOST_CONF_W_REG(pos) (HOST_SLCHOST_CONF_W0_REG+pos+(pos>23?4:0)+(pos>31?12:0))

#define HOST_SLCHOST_CONF_W0_REG          (DR_REG_SLCHOST_BASE + 0x6C)
/* HOST_SLCHOST_CONF3 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF3  0x000000FF
#define HOST_SLCHOST_CONF3_M  ((HOST_SLCHOST_CONF3_V)<<(HOST_SLCHOST_CONF3_S))
#define HOST_SLCHOST_CONF3_V  0xFF
#define HOST_SLCHOST_CONF3_S  24
/* HOST_SLCHOST_CONF2 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF2  0x000000FF
#define HOST_SLCHOST_CONF2_M  ((HOST_SLCHOST_CONF2_V)<<(HOST_SLCHOST_CONF2_S))
#define HOST_SLCHOST_CONF2_V  0xFF
#define HOST_SLCHOST_CONF2_S  16
/* HOST_SLCHOST_CONF1 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF1  0x000000FF
#define HOST_SLCHOST_CONF1_M  ((HOST_SLCHOST_CONF1_V)<<(HOST_SLCHOST_CONF1_S))
#define HOST_SLCHOST_CONF1_V  0xFF
#define HOST_SLCHOST_CONF1_S  8
/* HOST_SLCHOST_CONF0 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF0  0x000000FF
#define HOST_SLCHOST_CONF0_M  ((HOST_SLCHOST_CONF0_V)<<(HOST_SLCHOST_CONF0_S))
#define HOST_SLCHOST_CONF0_V  0xFF
#define HOST_SLCHOST_CONF0_S  0

#define HOST_SLCHOST_CONF_W1_REG          (DR_REG_SLCHOST_BASE + 0x70)
/* HOST_SLCHOST_CONF7 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF7  0x000000FF
#define HOST_SLCHOST_CONF7_M  ((HOST_SLCHOST_CONF7_V)<<(HOST_SLCHOST_CONF7_S))
#define HOST_SLCHOST_CONF7_V  0xFF
#define HOST_SLCHOST_CONF7_S  24
/* HOST_SLCHOST_CONF6 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF6  0x000000FF
#define HOST_SLCHOST_CONF6_M  ((HOST_SLCHOST_CONF6_V)<<(HOST_SLCHOST_CONF6_S))
#define HOST_SLCHOST_CONF6_V  0xFF
#define HOST_SLCHOST_CONF6_S  16
/* HOST_SLCHOST_CONF5 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF5  0x000000FF
#define HOST_SLCHOST_CONF5_M  ((HOST_SLCHOST_CONF5_V)<<(HOST_SLCHOST_CONF5_S))
#define HOST_SLCHOST_CONF5_V  0xFF
#define HOST_SLCHOST_CONF5_S  8
/* HOST_SLCHOST_CONF4 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF4  0x000000FF
#define HOST_SLCHOST_CONF4_M  ((HOST_SLCHOST_CONF4_V)<<(HOST_SLCHOST_CONF4_S))
#define HOST_SLCHOST_CONF4_V  0xFF
#define HOST_SLCHOST_CONF4_S  0

#define HOST_SLCHOST_CONF_W2_REG          (DR_REG_SLCHOST_BASE + 0x74)
/* HOST_SLCHOST_CONF11 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF11  0x000000FF
#define HOST_SLCHOST_CONF11_M  ((HOST_SLCHOST_CONF11_V)<<(HOST_SLCHOST_CONF11_S))
#define HOST_SLCHOST_CONF11_V  0xFF
#define HOST_SLCHOST_CONF11_S  24
/* HOST_SLCHOST_CONF10 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF10  0x000000FF
#define HOST_SLCHOST_CONF10_M  ((HOST_SLCHOST_CONF10_V)<<(HOST_SLCHOST_CONF10_S))
#define HOST_SLCHOST_CONF10_V  0xFF
#define HOST_SLCHOST_CONF10_S  16
/* HOST_SLCHOST_CONF9 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF9  0x000000FF
#define HOST_SLCHOST_CONF9_M  ((HOST_SLCHOST_CONF9_V)<<(HOST_SLCHOST_CONF9_S))
#define HOST_SLCHOST_CONF9_V  0xFF
#define HOST_SLCHOST_CONF9_S  8
/* HOST_SLCHOST_CONF8 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF8  0x000000FF
#define HOST_SLCHOST_CONF8_M  ((HOST_SLCHOST_CONF8_V)<<(HOST_SLCHOST_CONF8_S))
#define HOST_SLCHOST_CONF8_V  0xFF
#define HOST_SLCHOST_CONF8_S  0

#define HOST_SLCHOST_CONF_W3_REG          (DR_REG_SLCHOST_BASE + 0x78)
/* HOST_SLCHOST_CONF15 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF15  0x000000FF
#define HOST_SLCHOST_CONF15_M  ((HOST_SLCHOST_CONF15_V)<<(HOST_SLCHOST_CONF15_S))
#define HOST_SLCHOST_CONF15_V  0xFF
#define HOST_SLCHOST_CONF15_S  24
/* HOST_SLCHOST_CONF14 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF14  0x000000FF
#define HOST_SLCHOST_CONF14_M  ((HOST_SLCHOST_CONF14_V)<<(HOST_SLCHOST_CONF14_S))
#define HOST_SLCHOST_CONF14_V  0xFF
#define HOST_SLCHOST_CONF14_S  16
/* HOST_SLCHOST_CONF13 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF13  0x000000FF
#define HOST_SLCHOST_CONF13_M  ((HOST_SLCHOST_CONF13_V)<<(HOST_SLCHOST_CONF13_S))
#define HOST_SLCHOST_CONF13_V  0xFF
#define HOST_SLCHOST_CONF13_S  8
/* HOST_SLCHOST_CONF12 : R/W ;bitpos:[7:0] ;default: 8'hc0 ; */
/*description: */
#define HOST_SLCHOST_CONF12  0x000000FF
#define HOST_SLCHOST_CONF12_M  ((HOST_SLCHOST_CONF12_V)<<(HOST_SLCHOST_CONF12_S))
#define HOST_SLCHOST_CONF12_V  0xFF
#define HOST_SLCHOST_CONF12_S  0

#define HOST_SLCHOST_CONF_W4_REG          (DR_REG_SLCHOST_BASE + 0x7C)
/* HOST_SLCHOST_CONF19 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: Interrupt to target CPU*/
#define HOST_SLCHOST_CONF19  0x000000FF
#define HOST_SLCHOST_CONF19_M  ((HOST_SLCHOST_CONF19_V)<<(HOST_SLCHOST_CONF19_S))
#define HOST_SLCHOST_CONF19_V  0xFF
#define HOST_SLCHOST_CONF19_S  24
/* HOST_SLCHOST_CONF18 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF18  0x000000FF
#define HOST_SLCHOST_CONF18_M  ((HOST_SLCHOST_CONF18_V)<<(HOST_SLCHOST_CONF18_S))
#define HOST_SLCHOST_CONF18_V  0xFF
#define HOST_SLCHOST_CONF18_S  16
/* HOST_SLCHOST_CONF17 : R/W ;bitpos:[15:8] ;default: 8'h1 ; */
/*description: SLC timeout enable*/
#define HOST_SLCHOST_CONF17  0x000000FF
#define HOST_SLCHOST_CONF17_M  ((HOST_SLCHOST_CONF17_V)<<(HOST_SLCHOST_CONF17_S))
#define HOST_SLCHOST_CONF17_V  0xFF
#define HOST_SLCHOST_CONF17_S  8
/* HOST_SLCHOST_CONF16 : R/W ;bitpos:[7:0] ;default: 8'hFF ; */
/*description: SLC timeout value*/
#define HOST_SLCHOST_CONF16  0x000000FF
#define HOST_SLCHOST_CONF16_M  ((HOST_SLCHOST_CONF16_V)<<(HOST_SLCHOST_CONF16_S))
#define HOST_SLCHOST_CONF16_V  0xFF
#define HOST_SLCHOST_CONF16_S  0

#define HOST_SLCHOST_CONF_W5_REG          (DR_REG_SLCHOST_BASE + 0x80)
/* HOST_SLCHOST_CONF23 : R/W ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF23  0x000000FF
#define HOST_SLCHOST_CONF23_M  ((HOST_SLCHOST_CONF23_V)<<(HOST_SLCHOST_CONF23_S))
#define HOST_SLCHOST_CONF23_V  0xFF
#define HOST_SLCHOST_CONF23_S  24
/* HOST_SLCHOST_CONF22 : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF22  0x000000FF
#define HOST_SLCHOST_CONF22_M  ((HOST_SLCHOST_CONF22_V)<<(HOST_SLCHOST_CONF22_S))
#define HOST_SLCHOST_CONF22_V  0xFF
#define HOST_SLCHOST_CONF22_S  16
/* HOST_SLCHOST_CONF21 : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF21  0x000000FF
#define HOST_SLCHOST_CONF21_M  ((HOST_SLCHOST_CONF21_V)<<(HOST_SLCHOST_CONF21_S))
#define HOST_SLCHOST_CONF21_V  0xFF
#define HOST_SLCHOST_CONF21_S  8
/* HOST_SLCHOST_CONF20 : R/W ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define HOST_SLCHOST_CONF20  0x000000FF
#define HOST_SLCHOST_CONF20_M  ((HOST_SLCHOST_CONF20_V)<<(HOST_SLCHOST_CONF20_S))
#define HOST_SLCHOST_CONF20_V  0xFF
#define HOST_SLCHOST_CONF20_S  0

#define HOST_SLCHOST_WIN_CMD_REG          (DR_REG_SLCHOST_BASE + 0x84)
/* HOST_SLCHOST_WIN_CMD : R/W ;bitpos:[15:0] ;default: 16'b0 ; */
/*description: */
#define HOST_SLCHOST_WIN_CMD  0x0000FFFF
#define HOST_SLCHOST_WIN_CMD_M  ((HOST_SLCHOST_WIN_CMD_V)<<(HOST_SLCHOST_WIN_CMD_S))
#define HOST_SLCHOST_WIN_CMD_V  0xFFFF
#define HOST_SLCHOST_WIN_CMD_S  0

